Great! Looks like the changes in the pull request function correctly. I set the source attribute to my repo fork ref with the modifications and got this TF output:
```
 # module.chip_api_token_function.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + description                    = "Generate a JWT for CHIP clients"
      + function_name                  = "project-chipAPI-token-dev"
      + handler                        = "/opt/nodejs/node_modules/datadog-lambda-js/handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws-us-gov:lambda:us-gov-west-1:002406178527:layer:Datadog-Extension:57",
          + "arn:aws-us-gov:lambda:us-gov-west-1:002406178527:layer:Datadog-Node18-x:109",
```

Lambda creates properly and the layers exist:
![image](https://github.com/DataDog/terraform-aws-lambda-datadog/assets/31904439/59348e4c-d9bf-4468-86e6-f07dbaaac3db)
